/*
############################################################################
############################################################################
############################################################################
############################### Fail #######################################
############################################################################
############################################################################
############################################################################
*/

#pragma once
// to use unsafe function
#pragma warning(disable: 4996)

#include <iostream>
#include <string>
#include <stack>

// 레이저 : 가장 안쪽에 중첩된 괄호쌍
// 쇠막대기 : 나머지 종류의 괄호쌍
using namespace std;

string input;
stack<char> stk;

int result = 0;

// 이 문제를 스택으로 어떻게 풀 수 있는지 계속 생각해보다 모르겠어서
// 검색해 보고 풀었다.

void solve_10799() {

	cin >> input;

	for (int i = 0; i < input.size(); i++) {
		// 여는 괄호일 경우
		if (input[i] == '(') {
			stk.push('(');
		}
		// 닫는 경우일 경우
		else {
			// 닫는 괄호가 레이저인 경우
			if (input[i-1] =='(') {
				stk.pop();
				result += stk.size();
			}
			// 닫는 괄호가 파이프의 끝인 경우
			else {
				stk.pop();
				result += 1;
			}
		}
	}
	cout << result;
}
